In [68]:
#General 

#Buidling an ETL Data Pipeline

#Step 1: Extract from CSV file into a Pandas Dataframe
#Step 2: Transform the data( clean the data) - Deal with missing and duplicate data 
#Step 3:Create a database
#Step: Load the clean data into the database

import pandas as pd
import psycopg2 # For comectimg python to postresql database
from sqlalchemy import create_engine # To efficiently manage and reuse the database connections

data = pd.read_csv("Softwaork.csv")
data.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,0,77
1,74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,51
2,72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,47
3,38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,65
4,64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,61

In [69]:
data.duplicated().sum()

np.int64(0)

In [70]:
#Remove duplicate records
data.drop_duplicates(keep='first', inplace=True)
data.duplicated().sum()

np.int64(0)

In [71]:
data.duplicated().sum()

np.int64(0)

In [72]:
# Explore missing data
data.isnull().sum()

employee_id                0
department                 0
region                     0
education               1034
gender                     0
recruitment_channel        0
no_of_trainings            0
age                        0
previous_year_rating    1812
length_of_service          0
awards_won                 0
avg_training_score         0
dtype: int64

In [73]:
data[data['education'].isnull()].head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score
49,3720,Sales & Marketing,region_2,NaN,m,sourcing,1,36,5.0,4,0,49
67,26977,Operations,region_2,NaN,m,sourcing,1,28,3.0,3,0,59
89,2347,Analytics,region_15,NaN,m,other,2,37,5.0,8,0,82
127,42719,Analytics,region_21,NaN,m,sourcing,1,27,NaN,1,0,80
138,2721,Analytics,region_22,NaN,f,sourcing,2,26,5.0,3,0,86

In [74]:
# Deal with missing data
data['education'].fillna('unknown', inplace=True)
data['previous_year_rating'].fillna(0, inplace=True)

C:\Users\Lana\AppData\Local\Temp\ipykernel_30168\2410344225.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['education'].fillna('unknown', inplace=True)
C:\Users\Lana\AppData\Local\Temp\ipykernel_30168\2410344225.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['previous_year_rating'].fillna(0, inplace=True)

In [75]:
data.isnull().sum()

employee_id             0
department              0
region                  0
education               0
gender                  0
recruitment_channel     0
no_of_trainings         0
age                     0
previous_year_rating    0
length_of_service       0
awards_won              0
avg_training_score      0
dtype: int64

In [76]:
#Create a database - PGAdmin and create a database table
#Database Credentials 
username = 'postgres'
password = 'lana'
host = 'localhost'
port = 5432
db_name = 'postgres'

In [77]:
# Extablish a connection
engine = create_engine(f'postgresql://{username}:{password}@{host}:{port}/{db_name}')

In [78]:
# Load the database table  - employee_table
data.to_sql('employee_table', engine, if_exists='replace',index=False)

#Close
engine.dispose()